import Shelf from './components/Shelf';
import { shelfOne, shelfTwo } from './misc/sampleData';
import './assets/styles.css';

export default function App() {
  return (
    <div className="App">
      <h1>React Basics: Практичне завдання</h1>

      <p>
        Завдання полягає в тому, щоб, вивчивши структуру коду нижче, знайти
        спосіб значно його поліпшити шляхом винесення повторюваних частин до
        окремих компонентів (див. теку <code>components</code>) з відповідними
        модифікаціями коду там, де це необхідно.
      </p>

      <p>
        Для зручності набір даних для першої та другої книжкових полиць вже
        підготовлено у файлі <code>misc/sampleData.js</code>, також немає
        потреби в написанні стилів &mdash; все необхідне оформлення вже
        реалізоване.
      </p>

      <p>
        Критерієм успішного виконання завдання є проходження всіх автотестів
        (всі "зелені").
      </p>

      {/* ========== Початок зони редагування =============== */}

    <Shelf title='Перша книжкова полиця' books={shelfOne} />
    <Shelf title='Друга книжкова полиця' books={shelfTwo} />

      {/* ========== Кінець зони редагування =============== */}
    </div>
  );
}
